Public Member Functions | Protected Member Functions | Friends | List of all members
ACAPI::Element::OpeningFloorPlanParameters Class Reference
Element Manager
#include <OpeningFloorPlanParameters.hpp>
 Inheritance diagram for ACAPI::Element::OpeningFloorPlanParameters:
 Public Member Functions
OpeningFloorPlanDisplayMode  | GetFloorPlanDisplayMode () const
DividedOpeningMode  | GetDividedOpeningMode () const
bool  | IsCutSurfacesUseLineOfCutElements () const
API_AttributeIndex  | GetCutSurfacesLineIndex () const
short  | GetCutSurfacesLinePenIndex () const
OpeningOpenEdgeStyle  | GetOpenEdgeStyle () const
bool  | IsOutlinesUseLineOfCutElements () const
API_AttributeIndex  | GetOutlinesUncutLineIndex () const
short  | GetOutlinesUncutLinePenIndex () const
API_AttributeIndex  | GetOutlinesOverheadLineIndex () const
short  | GetOutlinesOverheadLinePenIndex () const
bool  | GetUseCoverFills () const
bool  | IsCoverFillsUseFillsOfCutElements () const
API_AttributeIndex  | GetCoverFillsIndex () const
short  | GetCoverFillsPenIndex () const
short  | GetCoverFillsBackgroundPenIndex () const
API_HatchOrientationTypeID  | GetCoverFillOrientation () const
std::optional< API_CoverFillTransformation >  | GetCoverFillTransformation () const
bool  | IsShowReferenceAxis () const
API_AttributeIndex  | GetReferenceAxisLineTypeIndex () const
short  | GetReferenceAxisPenIndex () const
double  | GetReferenceAxisOverhang () const
bool  | HasCutSymbol () const
std::optional< API_Guid >  | GetCutSymbolLibpartId () const
std::optional< GDL::Parameters >  | GetCutSymbolParameters () const
bool  | HasUnCutSymbol () const
std::optional< API_Guid >  | GetUnCutSymbolLibpartId () const
std::optional< GDL::Parameters >  | GetUnCutSymbolParameters () const
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
OpeningFloorPlanParameters (std::shared_ptr< Impl::OpeningFloorPlanParametersBase > impl)
Constructs an OpeningFloorPlanParameters with an OpeningFloorPlanParameters implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Friends
 class  | Opening
 class  | OpeningDefault
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
It represents the floorplan parameters of an Opening element or an OpeningDefault element.
Since
Archicad 29
Constructor & Destructor Documentation
◆ OpeningFloorPlanParameters()
 ACAPI::Element::OpeningFloorPlanParameters::OpeningFloorPlanParameters  |  ( |  std::shared_ptr< Impl::OpeningFloorPlanParametersBase > |  impl | )
protected
Constructs an OpeningFloorPlanParameters with an OpeningFloorPlanParameters implementation.
Parameters
impl | The OpeningFloorPlanParameters implementation.
Member Function Documentation
◆ GetCoverFillOrientation()
 API_HatchOrientationTypeID ACAPI::Element::OpeningFloorPlanParameters::GetCoverFillOrientation  |  ( |   | ) |   const
Returns
Returns the type of the cover fill.
◆ GetCoverFillsBackgroundPenIndex()
 short ACAPI::Element::OpeningFloorPlanParameters::GetCoverFillsBackgroundPenIndex  |  ( |   | ) |   const
Returns
Returns the background pen index the cover fill.
◆ GetCoverFillsIndex()
 API_AttributeIndex ACAPI::Element::OpeningFloorPlanParameters::GetCoverFillsIndex  |  ( |   | ) |   const
Returns
Returns the fill type the cover fill.
◆ GetCoverFillsPenIndex()
 short ACAPI::Element::OpeningFloorPlanParameters::GetCoverFillsPenIndex  |  ( |   | ) |   const
Returns
Returns the foreground pen index the cover fill.
◆ GetCoverFillTransformation()
 std::optional< API_CoverFillTransformation > ACAPI::Element::OpeningFloorPlanParameters::GetCoverFillTransformation  |  ( |   | ) |   const
Returns
Returns the transformation of the cover fill.
Remarks
Not applicable to opening default.
◆ GetCutSurfacesLineIndex()
 API_AttributeIndex ACAPI::Element::OpeningFloorPlanParameters::GetCutSurfacesLineIndex  |  ( |   | ) |   const
Returns
Returns the cut line type of the opening(default).
◆ GetCutSurfacesLinePenIndex()
 short ACAPI::Element::OpeningFloorPlanParameters::GetCutSurfacesLinePenIndex  |  ( |   | ) |   const
Returns
Returns the cut line pen index of the opening(default).
◆ GetCutSymbolLibpartId()
 std::optional< API_Guid > ACAPI::Element::OpeningFloorPlanParameters::GetCutSymbolLibpartId  |  ( |   | ) |   const
Returns
Returns the main GUID of the cut symbol Library Part or std::nullopt if no cut symbol
◆ GetCutSymbolParameters()
 std::optional< GDL::Parameters > ACAPI::Element::OpeningFloorPlanParameters::GetCutSymbolParameters  |  ( |   | ) |   const
Returns
Returns the AddPar of the cut symbol Library Part or std::nullopt if no cut symbol
◆ GetDividedOpeningMode()
 DividedOpeningMode ACAPI::Element::OpeningFloorPlanParameters::GetDividedOpeningMode  |  ( |   | ) |   const
Returns
Returns the divided opening mode of the opening(default).
◆ GetFloorPlanDisplayMode()
 OpeningFloorPlanDisplayMode ACAPI::Element::OpeningFloorPlanParameters::GetFloorPlanDisplayMode  |  ( |   | ) |   const
Returns
Returns the floorplan display mode of the opening(default).
◆ GetOpenEdgeStyle()
 OpeningOpenEdgeStyle ACAPI::Element::OpeningFloorPlanParameters::GetOpenEdgeStyle  |  ( |   | ) |   const
Returns
Returns the open edge style of the opening(default).
◆ GetOutlinesOverheadLineIndex()
 API_AttributeIndex ACAPI::Element::OpeningFloorPlanParameters::GetOutlinesOverheadLineIndex  |  ( |   | ) |   const
Returns
Returns the overhead line type of the opening(default).
◆ GetOutlinesOverheadLinePenIndex()
 short ACAPI::Element::OpeningFloorPlanParameters::GetOutlinesOverheadLinePenIndex  |  ( |   | ) |   const
Returns
Returns the overhead line pen index of the opening(default).
◆ GetOutlinesUncutLineIndex()
 API_AttributeIndex ACAPI::Element::OpeningFloorPlanParameters::GetOutlinesUncutLineIndex  |  ( |   | ) |   const
Returns
Returns the uncut line type of the opening(default).
◆ GetOutlinesUncutLinePenIndex()
 short ACAPI::Element::OpeningFloorPlanParameters::GetOutlinesUncutLinePenIndex  |  ( |   | ) |   const
Returns
Returns the uncut line pen index of the opening(default).
◆ GetReferenceAxisLineTypeIndex()
 API_AttributeIndex ACAPI::Element::OpeningFloorPlanParameters::GetReferenceAxisLineTypeIndex  |  ( |   | ) |   const
Returns
Returns the line type of the reference axis.
◆ GetReferenceAxisOverhang()
 double ACAPI::Element::OpeningFloorPlanParameters::GetReferenceAxisOverhang  |  ( |   | ) |   const
Returns
Returns the overhang of the reference axis.
◆ GetReferenceAxisPenIndex()
 short ACAPI::Element::OpeningFloorPlanParameters::GetReferenceAxisPenIndex  |  ( |   | ) |   const
Returns
Returns the pen index of the reference axis.
◆ GetUnCutSymbolLibpartId()
 std::optional< API_Guid > ACAPI::Element::OpeningFloorPlanParameters::GetUnCutSymbolLibpartId  |  ( |   | ) |   const
Returns
Returns the main GUID of the uncut symbol Library Part or std::nullopt if no uncut symbol
◆ GetUnCutSymbolParameters()
 std::optional< GDL::Parameters > ACAPI::Element::OpeningFloorPlanParameters::GetUnCutSymbolParameters  |  ( |   | ) |   const
Returns
Returns the AddPar of the uncut symbol Library Part or std::nullopt if no uncut symbol
◆ GetUseCoverFills()
 bool ACAPI::Element::OpeningFloorPlanParameters::GetUseCoverFills  |  ( |   | ) |   const
Returns
Returns wether cover fill is used.
◆ HasCutSymbol()
 bool ACAPI::Element::OpeningFloorPlanParameters::HasCutSymbol  |  ( |   | ) |   const
Returns
Returns wether the opening has a cut symbol.
◆ HasUnCutSymbol()
 bool ACAPI::Element::OpeningFloorPlanParameters::HasUnCutSymbol  |  ( |   | ) |   const
Returns
Returns wether the opening has a uncut symbol.
◆ IsCoverFillsUseFillsOfCutElements()
 bool ACAPI::Element::OpeningFloorPlanParameters::IsCoverFillsUseFillsOfCutElements  |  ( |   | ) |   const
Returns
Returns wether the cover fill of the cut element is used.
◆ IsCutSurfacesUseLineOfCutElements()
 bool ACAPI::Element::OpeningFloorPlanParameters::IsCutSurfacesUseLineOfCutElements  |  ( |   | ) |   const
Returns
Returns wether the cut line type of the cut element is used for cut surfaces.
◆ IsOutlinesUseLineOfCutElements()
 bool ACAPI::Element::OpeningFloorPlanParameters::IsOutlinesUseLineOfCutElements  |  ( |   | ) |   const
Returns
Returns wether the uncut line type of the cut element is used.
◆ IsShowReferenceAxis()
 bool ACAPI::Element::OpeningFloorPlanParameters::IsShowReferenceAxis  |  ( |   | ) |   const
Returns
Returns wether to show the reference axis.